---
title: 区块链-技术驱动金融
date: 2018-02-23
tags: [区块链,读书笔记]
---

[《区块链-技术驱动金融》](https://book.douban.com/subject/26860970/ "豆瓣链接")  读书笔记。

<!--more-->

## 第一章 密码学及加密货币概述

### 密码安全的哈希函数
> 1. 碰撞阻力：理论上由于输入空间大于输出空间，所有的哈希函数都不具备碰撞阻力。我们认为当前未找到的碰撞的函数具有阻力（MD5已经被找到碰撞）。 
> 2. 隐秘性：知道输出值，无法反推输入值。
> 3. 谜题友好：知道输出值，没有比遍历更有效的找出输入值的方法。

### 区块链
> 通过**哈希指针**构建的链表的数据结构称为区块链（普通链表使用的是**地址指针**）。
> **哈希指针**保证了数据的不可篡改性。

### 数字签名
> 公钥即身份：只有知道私钥的人，才能发出可被公钥校验的消息。 

## 第二章 去中心化
### 分布式共识
> 技术上无法保障绝对的公式，通过奖励机制
> 隐形公式，长链胜出
> 奖励：区块奖励，交易费
> 工作量证明：算hash为无效计算，改为其它计算？改为利息制（按照余额分配）。
